phrases = [
    ['बालकः पठति।', 'बालकः पठन्ति।', 'बालक पठति।'],  # The boy reads.
    ['छात्रः लिखति।', 'छात्रः लिखन्ति।', 'छात्रा लिखति।'],  # The student writes.
    ['सा गायति।', 'सा गायन्ति।', 'सः गायति।'],  # She sings.
    ['काकः कूजति।', 'काकः कूजन्ति।', 'काका कूजति।'],  # The crow caws.
    ['गजः धावति।', 'गजः धावन्ति।', 'गजा धावति।'],  # The elephant runs.
    ['वृक्षः स्थिरः अस्ति।', 'वृक्षः स्थिरम् अस्ति।', 'वृक्षा स्थिरः अस्ति।'],  # The tree is steady.
    ['माता पाकं करोति।', 'माता पाकं कुरुते।', 'मातः पाकं करोति।'],  # The mother cooks.
    ['सः पुस्तकं धारयति।', 'सः पुस्तकं धारयन्ति।', 'सः पुस्तक धारयति।'],  # He holds the book.
    ['अस्माकं मित्रं आगच्छति।', 'अस्माकं मित्रं आगच्छन्ति।', 'अस्माकः मित्रं आगच्छति।'],  # Our friend comes.
    ['माला पुष्पाणि विकसन्ति।', 'माला पुष्पाणि विकसति।', 'माला पुष्पं विकसन्ति।'],  # The garland's flowers bloom.
]

import random
def generate(data):
    i = random.randint(0, len(phrases) - 1)
    data['params']['a'] = phrases[i][0]
    data['params']['b'] = phrases[i][1]
    data['params']['c'] = phrases[i][2]
